## Q1

In [1]:
import pandas as pd

In [2]:
# Series function
df=pd.Series([4,8,15,16,23,42])
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
# Dataframe function
data=pd.DataFrame({"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})
data

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [4]:
# head
data.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [5]:
# tail
data.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [6]:
# describe
data.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

## Q2

In [7]:
data2=pd.DataFrame({"A":["Alice","Bob","Claire"],"B":[25,30,27],"C":["Female","Male","Female"]})
data2

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [8]:
def reindex_dataframe(df):
    # Get the number of rows in the DataFrame
    num_rows = df.shape[0]
    # Create a new index based on a sequence that starts from 1 and increments by 2
    new_index = pd.Index(range(1, num_rows*2+1, 2), name='new_index')
    # Set the new index on the DataFrame
    df = df.set_index(new_index)
    # Return the re-indexed DataFrame
    return df

In [9]:
reindex_dataframe(data2)

                A   B       C
new_index
1           Alice  25  Female
3             Bob  30    Male
5          Claire  27  Female

## Q3

In [10]:
data2=pd.DataFrame({"Values":[5,15,25,35]})

In [11]:
def sum(df):
    return df["Values"][0]+df["Values"][1]+df["Values"][2]

In [12]:
print(sum(data2))

45

In [13]:
data3=pd.DataFrame({"Values":[10,20,30,35,14,26,25,14,25,3,6,478,266,63,56]})
print(sum(data3))

60

## Q4

In [14]:
data2["Text"]=pd.Series(["This is a sample text","This is another text","I am learning Pandas","Hi"])

In [15]:
data2

   Values                   Text
0       5  This is a sample text
1      15   This is another text
2      25   I am learning Pandas
3      35                     Hi

In [16]:
def add_word_count_column(df):
    # Apply a lambda function to the 'Text' column that splits each row into words
    # and returns the length of the resulting list
    word_count = df['Text'].apply(lambda x: len(x.split()))
    # Add the 'Word_Count' column to the DataFrame
    df['Word_Count'] = word_count
    # Return the DataFrame with the new column
    return df

In [17]:
add_word_count_column(data2)

   Values                   Text  Word_Count
0       5  This is a sample text           5
1      15   This is another text           4
2      25   I am learning Pandas           4
3      35                     Hi           1

## Q5

Both DataFrame.size() and DataFrame.shape() are used to get information about the size of a pandas DataFrame, but they provide different information.

DataFrame.size() returns the total number of elements in the DataFrame, which is equivalent to the number of rows multiplied by the number of columns. It returns a single integer value.

DataFrame.shape() returns a tuple that contains the number of rows and the number of columns in the DataFrame. The tuple has the form (num_rows, num_columns). For example, if a DataFrame has 5 rows and 3 columns, DataFrame.shape() will return the tuple (5, 3).

## Q6

pd.read_excel() function is used to read excel files

## Q7

In [18]:
data2['email']=pd.Series(["sashka@gmail.com","asajkndka@gmail.com","ckkjs@gmail.com","rohan@yahoo.com"])

In [19]:
def username_find(df):
    username = df['email'].str.split('@',expand=True)[0]
    # Add the 'Word_Count' column to the DataFrame
    df['Username'] = username
    # Return the DataFrame with the new column
    return df

In [20]:
username_find(data2)
data2

   Values                   Text  Word_Count                email   Username
0       5  This is a sample text           5     sashka@gmail.com     sashka
1      15   This is another text           4  asajkndka@gmail.com  asajkndka
2      25   I am learning Pandas           4      ckkjs@gmail.com      ckkjs
3      35                     Hi           1      rohan@yahoo.com      rohan

## Q8

In [21]:
A=pd.Series([3,8,6,2,9])
B=pd.Series([5,2,9,3,1])
C=pd.Series([1,7,4,5,2])
df=pd.DataFrame({"A":A,"B":B,"C":C})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [23]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9

In [25]:
import pandas as pd

def calculate_stats(df):
    # Calculate the mean, median, and standard deviation of the 'Values' column
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_dev = df['Values'].std()
    
    # Print the statistics
    print("Mean:", mean)
    print("Median:", median)
    print("Standard deviation:", std_dev)

In [26]:
# Create a sample DataFrame
df = pd.DataFrame({'Values': [1, 2, 3, 4, 5]})

# Use the function to calculate the statistics
calculate_stats(df)

Mean: 3.0
Median: 3.0
Standard deviation: 1.5811388300841898

## Q10

In [27]:
import pandas as pd

def calculate_moving_average(df):
    # Calculate the moving average using a rolling window of size 7
    ma = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    # Add the moving average as a new column in the DataFrame
    df['MovingAverage'] = ma
    
    return df

In [28]:
# Create a sample DataFrame
df = pd.DataFrame({'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100],
                   'Date': pd.date_range(start='2022-01-01', periods=10, freq='D')})

# Set the 'Date' column as the index of the DataFrame
df.set_index('Date', inplace=True)

# Use the function to calculate the moving average
df = calculate_moving_average(df)

# Print the resulting DataFrame
print(df)

            Sales  MovingAverage
Date
2022-01-01     10           10.0
2022-01-02     20           15.0
2022-01-03     30           20.0
2022-01-04     40           25.0
2022-01-05     50           30.0
2022-01-06     60           35.0
2022-01-07     70           40.0
2022-01-08     80           50.0
2022-01-09     90           60.0
2022-01-10    100           70.0

## Q11

In [29]:
import pandas as pd

def add_weekday_column(df):
    # Convert the 'Date' column to a datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Extract the weekday name from the 'Date' column and store it in a new column named 'Weekday'
    df['Weekday'] = df['Date'].dt.day_name()
    
    return df

In [31]:
# Create a sample DataFrame
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2022-01-04', '2022-01-05']})

# Use the function to add a 'Weekday' column
df = add_weekday_column(df)

# Print the resulting DataFrame
print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2022-01-04    Tuesday
4 2022-01-05  Wednesday

## Q12

In [33]:
import pandas as pd

def select_january_dates(df):
    # Convert the 'Date' column to a datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Select all rows where the date is between '2023-01-01' and '2023-01-31'
    selected_rows = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    
    return selected_rows

In [34]:
# Create a sample DataFrame
df = pd.DataFrame({'Date': ['2022-12-31', '2023-01-01', '2023-01-15', '2023-01-31', '2023-02-01']})

# Use the function to select all rows where the date is between '2023-01-01' and '2023-01-31'
selected_rows = select_january_dates(df)

# Print the resulting DataFrame
print(selected_rows)

        Date
1 2023-01-01
2 2023-01-15
3 2023-01-31

## Q13

The first and foremost necessary library that needs to be imported to use the basic functions of Pandas is the pandas library itself.
To import pandas,run:
import pandas as pd
This imports the pandas library and aliases it as pd, which is a common convention used in the Pandas community. Once you have imported pandas, you can use its various functions and classes to work with data in a tabular format.